# "Apply" Function in PANDAS ~ df.apply()

In [28]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

1. View the "salary_year_avg" column

In [3]:
df['salary_year_avg']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
785736   NaN
785737   NaN
785738   NaN
785739   NaN
785740   NaN
Name: salary_year_avg, Length: 785741, dtype: float64

2. Use pd.notna() function to remove NaN values from the "salary" column

In [16]:
df[pd.notna(df['salary_year_avg'])]['salary_year_avg']
# use notna() function first and then access the column later

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

3. Use help() function to get more information of the "apply" function

In [6]:
help(df.apply)

Help on method apply in module pandas.core.frame:

apply(func: 'AggFuncType', axis: 'Axis' = 0, raw: 'bool' = False, result_type: "Literal['expand', 'reduce', 'broadcast'] | None" = None, args=(), by_row: "Literal[False, 'compat']" = 'compat', engine: "Literal['python', 'numba']" = 'python', engine_kwargs: 'dict[str, bool] | None' = None, **kwargs) method of pandas.core.frame.DataFrame instance
    Apply a function along an axis of the DataFrame.

    Objects passed to the function are Series objects whose index is
    either the DataFrame's index (``axis=0``) or the DataFrame's columns
    (``axis=1``). By default (``result_type=None``), the final return type
    is inferred from the return type of the applied function. Otherwise,
    it depends on the `result_type` argument.

    Parameters
    ----------
    func : function
        Function to apply to each column or row.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Axis along which the function is applied:

        * 0 or 'index': apply function to each column.
        * 1 or 'columns': apply function to each row.

    raw : bool, default False
        Determines if row or column is passed as a Series or ndarray object:

        * ``False`` : passes each row or column as a Series to the
          function.
        * ``True`` : the passed function will receive ndarray objects
          instead.
          If you are just applying a NumPy reduction function this will
          achieve much better performance.

    result_type : {'expand', 'reduce', 'broadcast', None}, default None
        These only act when ``axis=1`` (columns):

        * 'expand' : list-like results will be turned into columns.
        * 'reduce' : returns a Series if possible rather than expanding
          list-like results. This is the opposite of 'expand'.
        * 'broadcast' : results will be broadcast to the original shape
          of the DataFrame, the original index and columns will be
          retained.

        The default behaviour (None) depends on the return value of the
        applied function: list-like results will be returned as a Series
        of those. However if the apply function returns a Series these
        are expanded to columns.
    args : tuple
        Positional arguments to pass to `func` in addition to the
        array/series.
    by_row : False or "compat", default "compat"
        Only has an effect when ``func`` is a listlike or dictlike of funcs
        and the func isn't a string.
        If "compat", will if possible first translate the func into pandas
        methods (e.g. ``Series().apply(np.sum)`` will be translated to
        ``Series().sum()``). If that doesn't work, will try call to apply again with
        ``by_row=True`` and if that fails, will call apply again with
        ``by_row=False`` (backward compatible).
        If False, the funcs will be passed the whole Series at once.

        .. versionadded:: 2.1.0

    engine : {'python', 'numba'}, default 'python'
        Choose between the python (default) engine or the numba engine in apply.

        The numba engine will attempt to JIT compile the passed function,
        which may result in speedups for large DataFrames.
        It also supports the following engine_kwargs :

        - nopython (compile the function in nopython mode)
        - nogil (release the GIL inside the JIT compiled function)
        - parallel (try to apply the function in parallel over the DataFrame)

          Note: Due to limitations within numba/how pandas interfaces with numba,
          you should only use this if raw=True

        Note: The numba compiler only supports a subset of
        valid Python/numpy operations.

        Please read more about the `supported python features
        <https://numba.pydata.org/numba-doc/dev/reference/pysupported.html>`_
        and `supported numpy features
        <https://numba.pydata.org/numba-doc/dev/reference/numpysupported.html>`_
        in numba to learn what you can or cannot use in the passed function.

        .. versionadded:: 2.2.0

    engine_kwargs : dict
        Pass keyword arguments to the engine.
        This is currently only used by the numba engine,
        see the documentation for the engine argument for more information.
    **kwargs
        Additional keyword arguments to pass as keywords arguments to
        `func`.

    Returns
    -------
    Series or DataFrame
        Result of applying ``func`` along the given axis of the
        DataFrame.

    See Also
    --------
    DataFrame.map: For elementwise operations.
    DataFrame.aggregate: Only perform aggregating type operations.
    DataFrame.transform: Only perform transforming type operations.

    Notes
    -----
    Functions that mutate the passed object can produce unexpected
    behavior or errors and are not supported. See :ref:`gotchas.udf-mutation`
    for more details.

    Examples
    --------
    >>> df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
    >>> df
       A  B
    0  4  9
    1  4  9
    2  4  9

    Using a numpy universal function (in this case the same as
    ``np.sqrt(df)``):

    >>> df.apply(np.sqrt)
         A    B
    0  2.0  3.0
    1  2.0  3.0
    2  2.0  3.0

    Using a reducing function on either axis

    >>> df.apply(np.sum, axis=0)
    A    12
    B    27
    dtype: int64

    >>> df.apply(np.sum, axis=1)
    0    13
    1    13
    2    13
    dtype: int64

    Returning a list-like will result in a Series

    >>> df.apply(lambda x: [1, 2], axis=1)
    0    [1, 2]
    1    [1, 2]
    2    [1, 2]
    dtype: object

    Passing ``result_type='expand'`` will expand list-like results
    to columns of a Dataframe

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='expand')
       0  1
    0  1  2
    1  1  2
    2  1  2

    Returning a Series inside the function is similar to passing
    ``result_type='expand'``. The resulting column names
    will be the Series index.

    >>> df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)
       foo  bar
    0    1    2
    1    1    2
    2    1    2

    Passing ``result_type='broadcast'`` will ensure the same shape
    result, whether list-like or scalar is returned by the function,
    and broadcast it along the axis. The resulting column names will
    be the originals.

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')
       A  B
    0  1  2
    1  1  2
    2  1  2

4. Create a function to calculate projected salary

In [17]:
df_salary = df[pd.notna(df['salary_year_avg'])].copy()
def projected_salary(salary):
    return salary * 1.03

df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(projected_salary) # just provide the name of the fx
df_salary[['salary_year_avg','salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

--> so using this 'apply' function is like creating a new calculated column in Power Pivot, we can manipulate values of the other columns and put it into a new column

5. Use Lambda function

In [4]:
df_salary2 = df[pd.notna(df['salary_year_avg'])].copy()
df_salary2['salary_year_inflated'] = df_salary2['salary_year_avg'].apply(lambda salary : salary * 1.03)
df_salary2[['salary_year_avg','salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

6. Another approach instead of apply function and lambda function

In [6]:
df_salary2['salary_year_inflated2'] = df_salary2['salary_year_avg'] * 1.03

df_salary2[['salary_year_avg','salary_year_inflated2']]

        salary_year_avg  salary_year_inflated2
28             109500.0              112785.00
77             140000.0              144200.00
92             120000.0              123600.00
100            228222.0              235068.66
109             89000.0               91670.00
...                 ...                    ...
785624         139216.0              143392.48
785641         150000.0              154500.00
785648         221875.0              228531.25
785682         157500.0              162225.00
785692         157500.0              162225.00

[22003 rows x 2 columns]

7. Convert string data to a list

In [11]:
type(df['job_skills'][1])

str

- use the list function

In [13]:
list(df['job_skills'][1])

['[',
 "'",
 'r',
 "'",
 ',',
 ' ',
 "'",
 'p',
 'y',
 't',
 'h',
 'o',
 'n',
 "'",
 ',',
 ' ',
 "'",
 's',
 'q',
 'l',
 "'",
 ',',
 ' ',
 "'",
 'n',
 'o',
 's',
 'q',
 'l',
 "'",
 ',',
 ' ',
 "'",
 'p',
 'o',
 'w',
 'e',
 'r',
 ' ',
 'b',
 'i',
 "'",
 ',',
 ' ',
 "'",
 't',
 'a',
 'b',
 'l',
 'e',
 'a',
 'u',
 "'",
 ']']

--> this "list" function does not work as we want so we look for another one.

- behold the ast.literal_eval() function

In [17]:
import ast
job_skills = ast.literal_eval(df['job_skills'][1])
job_skills
type(job_skills)

list

- run this function on the entire column:

In [18]:

df['job_skills'] = ast.literal_eval(df['job_skills'])

ValueError: malformed node or string: 0                                                      None
1         ['r', 'python', 'sql', 'nosql', 'power bi', 't...
2         ['python', 'sql', 'c#', 'azure', 'airflow', 'd...
3         ['python', 'c++', 'java', 'matlab', 'aws', 'te...
4         ['bash', 'python', 'oracle', 'aws', 'ansible',...
                                ...
785736    ['bash', 'python', 'perl', 'linux', 'unix', 'k...
785737                       ['sas', 'sas', 'sql', 'excel']
785738                              ['powerpoint', 'excel']
785739    ['python', 'go', 'nosql', 'sql', 'mongo', 'she...
785740                                      ['aws', 'flow']
Name: job_skills, Length: 785741, dtype: object

--> errrrorrrr, we have to create a new function and use apply function.

- APPLY this function on the entire column

In [29]:
def clean_list(skill_list):
    if pd.notna(skill_list): # if the value in any row is None, skip the row
        return ast.literal_eval(skill_list)

df2 = df.copy()
df2['job_skills'] = df2['job_skills'].apply(clean_list) # remember there's no parentheses guys

In [22]:
type(df2['job_skills'][1]) # index 0 is Null

list

- Use Lambda function inside the apply function

In [33]:
df3 = df.copy()
df3['job_skills'] = df3['job_skills'].apply(lambda skill_list: ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list)
# that's how to apply conditional calculation inside the lambda function

In [34]:
df3['job_skills'][1]

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

--> Lambda is pretty important and will be seen in the next section, stay tuned baby

7. Use "apply" function to access rows instead columns

We are calculating projected salary on:
- Senior roles, assume a 5% increase
- Other roles, assume a 3% increase

In [ ]:
df_salary3 = df[pd.notna(df['salary_year_avg'])].copy()

def projected_salary(row): # the argument passed into this function is a whole row instead of a single value
    if "Senior" in row['job_title_short']: # get value in a specified column 
        return row['salary_year_avg'] * 1.05
    else:
        return row['salary_year_avg'] * 1.03

df_salary3['salary_year_inflated'] = df_salary3.apply(projected_salary, axis = 1)
# the diff here is we dont access any column before using the apply function
df_salary3.sample(20)

- Do it the "Lambda" way:

In [44]:
df_salary3 = df[pd.notna(df['salary_year_avg'])].copy()
df_salary3['salary_year_inflated'] = df_salary3.apply(lambda row : 1.05 *row['salary_year_avg'] if "Senior" in row['job_title_short'] else 1.03 * row ['salary_year_avg']  , axis = 1)

df_salary3.sample(20)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,salary_year_inflated
762660,Data Analyst,Data Analyst,"San Bruno, CA",via Indeed,Full-time,False,"California, United States",2023-05-04 20:01:17,True,False,United States,year,90000.0,NaN,LatentView Analytics,None,None,92700.000
783761,Senior Data Engineer,Senior Data Engineer,Anywhere,via LinkedIn,Full-time,True,"Texas, United States",2023-01-04 15:37:16,False,False,United States,year,130000.0,NaN,Elsdon Consulting ltd,"['azure', 'power bi']","{'analyst_tools': ['power bi'], 'cloud': ['azu...",136500.000
608014,Senior Data Scientist,Senior/Lead Data Scientist,"San Francisco, CA",via Ladders,Full-time,False,"California, United States",2023-10-24 09:03:33,False,False,United States,year,90000.0,NaN,Susa Ventures,"['sql', 'python', 'pyspark', 'unify']","{'libraries': ['pyspark'], 'programming': ['sq...",94500.000
52854,Data Engineer,Help Desk Analyst II,"Indianapolis, IN",via SonicJobs,Full-time,False,"Illinois, United States",2023-04-20 06:01:18,True,False,United States,year,50000.0,NaN,Robert Half,None,None,51500.000
739223,Software Engineer,BI Developer,"New Delhi, Delhi, India",via Ai-Jobs.net,Full-time,False,India,2023-01-30 21:11:50,False,False,India,year,79200.0,NaN,Armis Security,"['sql', 'python', 'java', 'snowflake', 'aws', ...","{'cloud': ['snowflake', 'aws', 'azure'], 'prog...",81576.000
751292,Senior Data Scientist,"Senior Data Scientist, End to End Data Systems","Santa Clara, CA",via Indeed,Full-time,False,"California, United States",2023-08-23 20:03:44,False,False,United States,year,203625.0,NaN,NVIDIA,"['sql', 'python', 'cassandra', 'spark', 'hadoop']","{'databases': ['cassandra'], 'libraries': ['sp...",213806.250
190292,Senior Data Analyst,Senior Data Analyst,None,via LinkedIn,Full-time,False,"New York, United States",2023-06-23 15:00:03,False,True,United States,year,122500.0,NaN,Synechron,"['sql', 'python', 'spreadsheet', 'excel', 'alt...","{'analyst_tools': ['spreadsheet', 'excel', 'al...",128625.000
630429,Data Scientist,Principal Data Scientist,Colorado,via LinkedIn,Full-time,False,Sudan,2023-11-01 12:39:35,False,False,Sudan,year,130000.0,NaN,YES! Communities,"['python', 'r', 'sql']","{'programming': ['python', 'r', 'sql']}",133900.000
120463,Data Scientist,Data Scientist,"El Segundo, CA",via Ladders,Full-time,False,"California, United States",2023-06-06 08:03:10,False,True,United States,year,150000.0,NaN,The Aerospace Corporation,"['python', 'docker', 'kubernetes']","{'other': ['docker', 'kubernetes'], 'programmi...",154500.000
498549,Senior Data Engineer,Senior Data Engineer,Anywhere,via LinkedIn,Full-time,True,"Texas, United States",2023-12-07 11:09:30,False,True,United States,year,151500.0,NaN,ARC IT Recruitment,"['python', 'aws', 'gcp', 'azure', 'airflow', '...","{'cloud': ['aws', 'gcp', 'azure'], 'libraries'...",159075.000
253169,Data Engineer,Lead Data Engineer,"Calgary, AB, Canada",via Ladders,Full-time,False,Canada,2023-01-19 08:00:42,False,False,Canada,year,90000.0,NaN,RBC,"['java', 'scala', 'sql', 'nosql', 'azure', 'aw...","{'cloud': ['azure', 'aws'], 'libraries': ['spr...",92700.000
182637,Senior Data Analyst,Senior Data Analyst,"Washington, DC",via ZipRecruiter,Full-time,False,"New York, United States",2023-07-25 15:00:50,False,False,United States,year,110000.0,NaN,Imagine One Technology & Management,"['python', 'qlik', 'tableau', 'spss', 'word', ...","{'analyst_tools': ['qlik', 'tableau', 'spss', ...",115500.000
617916,Machine Learning Engineer,Machine Learning Expert,"Brussels, Belgium",via Ai-Jobs.net,Full-time,False,Belgium,2023-03-08 12:11:06,False,False,Belgium,year,72900.0,NaN,Uni Systems,"['perl', 'python', 'matlab', 'r', 'sql', 'nosq...","{'cloud': ['aws', 'azure'], 'databases': ['mon...",75087.000
747774,Data Scientist,Director of Data Science (Insurance Underwriting),United States,via LinkedIn,Full-time,False,"Illinois, United States",2023-01-04 20:05:55,True,True,United States,year,222500.0,NaN,Averity,None,None,229175.000
490851,Senior Data Engineer,Senior Data Engineer,"San Francisco, CA",via Indeed,Full-time,False,Georgia,2023-06-14 11:46:36,True,True,United States,year,170000.0,NaN,Harnham,"['python', 'scala', 'azure', 'hadoop', 'spark'...","{'cloud': ['azure'], 'libraries': ['hadoop', '...",178500.000
287131,Senior Data Scientist,Senior Manager of Data Science,Anywhere,via LinkedIn,Full-time,True,Sudan,2023-01-17 17:50:02,False,False,Sudan,year,165000.0,NaN,Harnham,"['sql', 'python', 'sas', 'sas', 'watson', 'exc...","{'analyst_tools': ['sas', 'excel', 'tableau', ...",173250.000
542392,Data Analyst,Forensic Data Analyst,"St. Louis, MO",via LinkedIn,Full-time,False,"Illinois, United States",2023-10-03 19:01:37,False,True,United States,year,100774.5,NaN,National Geospatial-Intelligence Agency,"['c', 'python', 'sql', 'tableau', 'spss', 'exc...","{'analyst_tools': ['tableau', 'spss', 'excel']...",103797.735
421402,Data Engineer,Data Engineer,"Denver, CO",via LinkedIn,Full-time,False,"Illinois, United States",2023-01-04 16:31:27,False,False,United States,year,115000.0,NaN,EdgeLink,"['sql', 'python', 'sql server', 'databricks', ...","{'analyst_tools': ['power bi'], 'cloud': ['dat...",118450.000
648992,Data Scientist,"Data Scientist, Product Analytics","New York, NY",via Ladders,Full-time,False,"New York, United States",2023-07-25 12:03:02,False,True,United States,year,150000.0,NaN,Citizen.com,"['sql', 'python', 'r', 'bigquery', 'tableau', ...","{'analyst_tools': ['tableau', 'sheets'], 'clou...",154500.000
525704,Data Scientist,Lead Data Scientist,"Atlanta, GA",via JobServe,Full-time,False,Georgia,2023-07-27 11:55:45,False,True,United States,year,174720.0,NaN,Disney Media & Entertainment Distribution,"['python', 'sql', 'databricks', 'snowflake', '...","{'analyst_tools': ['tableau', 'looker'], 'clou...",179961.600